{
  "name": "Lean Manufacturing",
  "slug": "lean_manufacturing",
  "sector": "Manufacturing",
  "sector_slug": "manufacturing",
  "description": "Interview questions focused on lean principles, waste elimination, continuous improvement (Kaizen), value stream mapping, 5S methodology, kanban systems, Six Sigma integration, and the Toyota Production System in manufacturing environments.",
  "questions": [
    {
      "question_text": "Identify and explain the seven wastes (Muda) in lean manufacturing and provide a practical manufacturing example of each.",
      "question_type": "technical",
      "difficulty": "medium",
      "expected_answer": "The seven wastes are: 1) Overproduction, producing more than customer demand requires, for example manufacturing 1,000 units when only 800 are ordered, leading to excess inventory. 2) Waiting, idle time when materials, information, or equipment are not ready, such as an operator waiting for parts from a previous workstation. 3) Transportation, unnecessary movement of materials between processes, like moving parts across the facility due to poor layout. 4) Over-processing, performing more work than the customer requires, such as polishing a surface that will be hidden in the final assembly. 5) Inventory, excess raw materials, WIP, or finished goods beyond what is needed, tying up capital and space. 6) Motion, unnecessary physical movement by workers, such as walking to retrieve tools stored far from the workstation. 7) Defects, producing products that require rework, scrap, or inspection, such as parts that do not meet specifications. Some practitioners add an eighth waste: underutilized talent, not leveraging worker skills and ideas for improvement.",
      "keywords": ["seven wastes", "Muda", "overproduction", "waiting", "transportation", "over-processing", "inventory", "motion", "defects", "eighth waste"]
    },
    {
      "question_text": "Explain the process of Value Stream Mapping (VSM) and how it is used to identify improvement opportunities.",
      "question_type": "technical",
      "difficulty": "hard",
      "expected_answer": "Value Stream Mapping is a lean tool that visually documents the flow of materials and information from raw material to finished product delivery. The process involves: 1) Selecting a product family to map. 2) Drawing the current state map by walking the actual production flow, documenting each process step with data boxes showing cycle time, changeover time, uptime, batch size, number of operators, and available working time. Inventory triangles show WIP between steps. Information flow (production schedules, orders, forecasts) is mapped in the upper portion. A timeline at the bottom calculates total lead time versus value-added time. 3) Analyzing the current state to identify wastes, bottlenecks, and improvement opportunities, focusing on the ratio of value-added to non-value-added time. 4) Drawing a future state map incorporating lean improvements such as continuous flow, pull systems, leveled production, reduced changeover times, and improved information flow. 5) Creating an implementation plan with prioritized projects to move from current to future state. VSM is powerful because it provides a holistic view of the entire value stream rather than optimizing individual operations in isolation.",
      "keywords": ["value stream mapping", "VSM", "current state", "future state", "lead time", "value-added time", "material flow", "information flow", "bottleneck"]
    },
    {
      "question_text": "Describe the 5S methodology, its five steps, and how it contributes to operational excellence.",
      "question_type": "technical",
      "difficulty": "easy",
      "expected_answer": "5S is a workplace organization methodology that creates a clean, orderly, and efficient work environment. The five steps are: 1) Sort (Seiri), remove all unnecessary items from the work area, using red-tagging to identify items for removal. 2) Set in Order (Seiton), organize remaining items with designated locations, shadow boards, labels, and floor markings so everything has a place and is easily accessible. 3) Shine (Seiso), clean the workplace thoroughly and establish cleaning as a form of inspection, identifying equipment issues early. 4) Standardize (Seiketsu), create visual standards and procedures to maintain the first three steps, including checklists, photos of correct conditions, and defined responsibilities. 5) Sustain (Shitsuke), build the discipline and habits to maintain 5S through regular audits, training, and management commitment. 5S contributes to operational excellence by reducing wasted motion and search time, improving safety by eliminating clutter and hazards, enabling visual management of abnormalities, improving morale and pride in the workplace, and providing the foundation for more advanced lean tools.",
      "keywords": ["5S", "Sort", "Set in Order", "Shine", "Standardize", "Sustain", "workplace organization", "visual management", "red tag"]
    },
    {
      "question_text": "Explain how a Kanban system works and how it supports pull-based production.",
      "question_type": "technical",
      "difficulty": "medium",
      "expected_answer": "Kanban is a visual signaling system that controls the production and movement of materials in a pull-based manufacturing system. The word kanban means signboard or card in Japanese. In a basic two-bin kanban system, production or replenishment of a part is triggered only when a signal (card, empty bin, electronic signal) indicates that downstream consumption has occurred. Key elements include: kanban cards or signals that authorize production or material movement, defined quantities per kanban (container size), calculated number of kanbans based on demand rate, replenishment lead time, and safety factor, supermarket locations where inventory is stored between processes, and strict rules such as downstream processes withdraw only what is needed, upstream processes produce only what has been withdrawn, and no items are produced or moved without a kanban signal. Kanban supports pull production by limiting work-in-process inventory to the number of kanbans in the system, preventing overproduction, making production problems visible through the absence of cards, and creating a self-regulating system that adjusts to actual demand rather than forecasts.",
      "keywords": ["kanban", "pull system", "visual signal", "WIP limit", "supermarket", "replenishment", "demand-driven", "two-bin system"]
    },
    {
      "question_text": "What is Single-Minute Exchange of Die (SMED), and how does it reduce changeover time?",
      "question_type": "technical",
      "difficulty": "hard",
      "expected_answer": "SMED is a systematic approach developed by Shigeo Shingo to reduce equipment changeover time to under 10 minutes (single-digit minutes). The methodology has three main stages: 1) Separate internal and external activities. Internal activities can only be performed when the machine is stopped (mounting a die), while external activities can be done while the machine is running (preparing tools, pre-heating a die). Often 30-50% of changeover time can be saved simply by converting internal activities to external ones. 2) Convert internal activities to external where possible, through preparation, pre-assembly, intermediate jigs and fixtures, or functional standardization. 3) Streamline all remaining activities by eliminating adjustments (using fixed stops and locating pins), implementing parallel operations (two people working simultaneously), using quick-release mechanisms instead of bolts, and standardizing tooling. SMED enables smaller batch sizes and more frequent changeovers, which reduces inventory, improves responsiveness to customer demand, increases effective capacity, and supports mixed-model production. Typical results achieve 50-90% reduction in changeover time.",
      "keywords": ["SMED", "changeover", "internal setup", "external setup", "batch size", "Shigeo Shingo", "quick changeover", "parallel operations"]
    },
    {
      "question_text": "Describe the PDCA (Plan-Do-Check-Act) cycle and how it drives continuous improvement in lean manufacturing.",
      "question_type": "technical",
      "difficulty": "easy",
      "expected_answer": "The PDCA cycle, also known as the Deming Cycle, is a four-step iterative method for continuous improvement. Plan involves identifying a problem or improvement opportunity, analyzing the current situation with data, determining root causes, and developing a hypothesis and action plan with measurable objectives. Do involves implementing the plan on a small scale as a pilot or trial, collecting data during implementation. Check involves comparing actual results against expected outcomes, analyzing data to validate or invalidate the hypothesis, and identifying what worked and what did not. Act involves standardizing successful changes by updating procedures, training, and controls, or if results were unsatisfactory, returning to the Plan stage with new insights. PDCA drives continuous improvement by creating a structured, scientific approach to problem-solving, building organizational learning through repeated cycles, preventing jumping to solutions without proper analysis, ensuring changes are verified before full-scale deployment, and establishing a culture where improvement is an ongoing process rather than a one-time event. Each completed cycle raises the performance baseline for the next cycle.",
      "keywords": ["PDCA", "Plan-Do-Check-Act", "Deming Cycle", "continuous improvement", "hypothesis testing", "standardization", "iterative", "problem-solving"]
    },
    {
      "question_text": "What is Takt Time, and how is it used to balance production lines?",
      "question_type": "technical",
      "difficulty": "medium",
      "expected_answer": "Takt time is the rate at which a product must be produced to meet customer demand. It is calculated by dividing the available production time per period by the customer demand per period. For example, if available time is 480 minutes per shift and customer demand is 240 units per shift, the takt time is 2 minutes per unit. Takt time is used to balance production lines by: establishing the rhythm or heartbeat of production that matches customer demand, designing workstations so each station's cycle time is as close to takt time as possible without exceeding it, determining the number of workstations and operators needed (total work content divided by takt time), identifying bottleneck operations where cycle time exceeds takt time and targeting them for improvement, and enabling visual management where any station falling behind takt is immediately visible. When cycle time exceeds takt time, the production line cannot meet demand. When cycle time is significantly less than takt time, resources are being underutilized. The goal is to achieve a balanced line where every workstation operates close to takt time.",
      "keywords": ["takt time", "line balancing", "customer demand", "cycle time", "available time", "bottleneck", "workstation", "production rhythm"]
    },
    {
      "question_text": "How do Lean and Six Sigma integrate, and what is Lean Six Sigma?",
      "question_type": "technical",
      "difficulty": "medium",
      "expected_answer": "Lean focuses on speed and waste elimination, reducing non-value-added activities and improving flow. Six Sigma focuses on quality and variation reduction, using statistical methods to achieve near-perfect process performance (3.4 defects per million opportunities). Lean Six Sigma integrates both approaches to simultaneously improve speed and quality. Lean provides tools for identifying and eliminating waste (VSM, 5S, kanban, SMED, flow), while Six Sigma provides a rigorous analytical framework (DMAIC methodology) and statistical tools (hypothesis testing, regression analysis, Design of Experiments, control charts) for solving complex variation problems. In practice, Lean Six Sigma projects use DMAIC as the overall problem-solving framework while incorporating lean tools throughout. For example, in the Define phase, a value stream map identifies the most impactful improvement area. In the Analyze phase, statistical tools pinpoint root causes of variation. In the Improve phase, lean tools like flow and pull systems may be implemented alongside statistical process control. This integration creates a more comprehensive improvement approach than either methodology alone.",
      "keywords": ["Lean Six Sigma", "DMAIC", "waste elimination", "variation reduction", "statistical tools", "flow", "integration", "process improvement"]
    },
    {
      "question_text": "Explain the concept of Jidoka (autonomation) and its role in the Toyota Production System.",
      "question_type": "technical",
      "difficulty": "hard",
      "expected_answer": "Jidoka, or autonomation (automation with a human touch), is one of the two pillars of the Toyota Production System alongside Just-in-Time. The concept means that machines are designed to detect abnormal conditions or defects and automatically stop, preventing the production of defective products. This differs from simple automation because the machine has built-in intelligence to distinguish normal from abnormal operation. Key principles include: machines that detect abnormalities and stop automatically, andon systems (visual and audible signals) that alert operators and supervisors when a stoppage occurs, empowering operators to stop the production line when they detect a quality problem, separating human work from machine work so one operator can monitor multiple machines, and building quality into the process rather than inspecting it in afterward. When a stoppage occurs, the root cause is immediately investigated and countermeasures are implemented before production resumes. Jidoka prevents defects from flowing downstream, makes problems visible so they can be solved permanently, and respects human intelligence by freeing workers from simply watching machines to instead focusing on problem-solving and improvement.",
      "keywords": ["Jidoka", "autonomation", "Toyota Production System", "andon", "automatic stop", "built-in quality", "abnormality detection", "root cause"]
    },
    {
      "question_text": "What is a Gemba Walk, and how should it be conducted effectively?",
      "question_type": "technical",
      "difficulty": "easy",
      "expected_answer": "A Gemba Walk is a management practice where leaders go to the actual workplace (gemba means the real place in Japanese) to observe processes, engage with workers, and understand operations firsthand. Unlike a traditional management tour, a Gemba Walk has specific principles: go to see and understand the actual process, not to direct or inspect; show respect for the people doing the work; ask open-ended questions to understand rather than to interrogate; observe the process with fresh eyes looking for waste and abnormalities; listen to worker ideas and concerns; and resist the urge to immediately solve problems or give orders. Effective Gemba Walks should focus on a specific theme or process area, follow a standard route to enable comparison over time, use a structured observation checklist, include time for meaningful dialogue with frontline workers, result in documented observations and follow-up actions, be conducted regularly by all levels of management, and be part of a broader lean management system that connects observations to improvement actions.",
      "keywords": ["Gemba Walk", "go and see", "observation", "respect for people", "lean management", "frontline engagement", "standard work", "follow-up"]
    },
    {
      "question_text": "Tell me about a time when you led a Kaizen event or continuous improvement initiative. What approach did you take and what results did you achieve?",
      "question_type": "behavioral",
      "difficulty": "medium",
      "expected_answer": "A strong answer should describe a specific Kaizen event or improvement project, including the problem statement, scope, team composition, methodology used, key activities, and measurable results. The candidate should explain how they selected the problem (data-driven prioritization), formed a cross-functional team including frontline workers, set clear objectives and time boundaries, facilitated the team through root cause analysis and solution development, overcame resistance to change, and sustained the improvements. Results should be quantified, such as reduction in lead time, cycle time, defect rate, floor space, or WIP inventory. The answer should also address how standard work was updated, how gains were sustained through visual management and ongoing monitoring, and what was learned that was applied to subsequent improvement efforts.",
      "keywords": ["Kaizen", "continuous improvement", "cross-functional team", "measurable results", "root cause", "standard work", "sustainability", "facilitation"]
    },
    {
      "question_text": "Describe a situation where you encountered resistance to lean implementation. How did you overcome it?",
      "question_type": "behavioral",
      "difficulty": "hard",
      "expected_answer": "The candidate should describe a specific resistance scenario, whether from operators concerned about job security, supervisors skeptical of new methods, or management questioning ROI. The answer should demonstrate understanding of why people resist change (fear of the unknown, comfort with current methods, past failed initiatives, perceived threat to status or expertise). The candidate should explain their approach to overcoming resistance: listening to concerns without dismissing them, involving resistors in the improvement process to build ownership, demonstrating quick wins to build credibility, using data to show the need for change, providing education and training, finding and developing internal champions, addressing legitimate concerns directly, and being patient while persistent. The outcome should show that resistance was converted to support, or at minimum, that the lean implementation moved forward successfully with improved buy-in.",
      "keywords": ["resistance to change", "lean implementation", "change management", "buy-in", "quick wins", "involvement", "education", "champions"]
    },
    {
      "question_text": "Give an example of how you used data to identify waste or inefficiency in a manufacturing process.",
      "question_type": "behavioral",
      "difficulty": "easy",
      "expected_answer": "The candidate should describe a specific instance where they collected and analyzed data to uncover hidden waste. This might include analyzing cycle time data to find bottlenecks, tracking downtime reasons with Pareto analysis, measuring OEE to identify the largest equipment losses, performing time studies to discover motion waste, analyzing scrap and rework data to find quality cost drivers, or reviewing inventory turns to identify excess stock. The answer should demonstrate proficiency with data collection methods, analytical tools, and the ability to translate data into actionable improvement opportunities. Key elements include what data was collected and how, what analysis was performed, what the data revealed that was not previously recognized, what actions were taken based on the findings, and the measurable impact of those actions.",
      "keywords": ["data analysis", "waste identification", "Pareto analysis", "OEE", "time study", "cycle time", "downtime", "data-driven improvement"]
    },
    {
      "question_text": "Tell me about a lean improvement that did not go as planned. What happened and what did you learn?",
      "question_type": "behavioral",
      "difficulty": "medium",
      "expected_answer": "A strong answer demonstrates honesty, self-awareness, and learning from failure. The candidate should describe a specific lean initiative that fell short of expectations, the contributing factors (insufficient planning, inadequate stakeholder engagement, scope too broad, underestimated complexity, lack of sustainment plan, inadequate training, or unforeseen constraints), and the actions taken to recover or mitigate the impact. Most importantly, the answer should clearly articulate the lessons learned and how those lessons improved subsequent improvement efforts. For example, learning the importance of management commitment led to better executive sponsorship in future projects, or realizing the need for better change management led to developing a more structured communication and engagement approach. The answer shows maturity and demonstrates the lean principle that failures are learning opportunities.",
      "keywords": ["failure", "learning", "self-awareness", "recovery", "lessons learned", "root cause of failure", "improvement", "change management"]
    },
    {
      "question_text": "Describe a time when you mentored or coached others in lean principles and practices.",
      "question_type": "behavioral",
      "difficulty": "easy",
      "expected_answer": "The candidate should describe a specific coaching or mentoring experience, whether formal training, on-the-job coaching during Kaizen events, developing lean champions, or building a lean culture in a team. The answer should cover how they assessed the learner's current knowledge level, adapted their teaching approach to the audience, used practical hands-on examples rather than just theory, created opportunities for learners to practice lean tools in real situations, provided constructive feedback, and measured the development of lean capabilities. The answer should demonstrate patience, passion for lean, ability to communicate complex concepts simply, and commitment to developing others. Outcomes should include specific examples of how the people they coached went on to apply lean thinking independently or lead their own improvement initiatives.",
      "keywords": ["coaching", "mentoring", "lean training", "knowledge transfer", "hands-on learning", "developing others", "lean culture", "capability building"]
    },
    {
      "question_text": "Your plant manager wants to implement lean manufacturing across the entire facility at once rather than starting with a pilot area. How would you advise them?",
      "question_type": "situational",
      "difficulty": "medium",
      "expected_answer": "Respectfully advise against a facility-wide simultaneous implementation and recommend a phased approach. Explain the risks of attempting too much at once: insufficient resources to support all areas, inability to provide adequate training and coaching, overwhelming the workforce with change, no opportunity to learn and adjust before scaling, and higher risk of failure that could discredit lean for the entire organization. Recommend starting with a pilot area or model line selected based on criteria such as high visibility, supportive leadership, clear improvement potential, and manageable scope. Use the pilot to demonstrate measurable results, develop internal lean expertise, refine the implementation approach, create success stories and internal champions, and build a template that can be replicated. Propose a phased rollout plan with clear milestones, expanding from the pilot to adjacent areas in waves. Present examples of companies that failed with big-bang implementations versus those that succeeded with phased approaches. Emphasize that lean is a long-term cultural transformation, not a project with an end date.",
      "keywords": ["phased implementation", "pilot area", "model line", "change management", "scalability", "internal champions", "cultural transformation", "risk mitigation"]
    },
    {
      "question_text": "A production line has an Overall Equipment Effectiveness (OEE) of 55%. How would you approach improving it?",
      "question_type": "situational",
      "difficulty": "medium",
      "expected_answer": "First, decompose OEE into its three components to identify the primary loss driver: Availability (downtime losses from breakdowns and changeovers), Performance (speed losses from minor stops and reduced speed), and Quality (defect losses from scrap and rework). World-class OEE is approximately 85%, so at 55% there is significant room for improvement. For availability losses: implement Total Productive Maintenance (TPM) with autonomous maintenance and preventive maintenance schedules, apply SMED to reduce changeover time, and use Pareto analysis to prioritize the most frequent breakdown causes. For performance losses: investigate root causes of minor stoppages, check if the machine is running at design speed or if speed has been reduced as a workaround for quality or reliability issues, and address jams or short stops with targeted improvements. For quality losses: conduct root cause analysis on the top defect categories, implement mistake-proofing (poka-yoke), and tighten process controls. Start by collecting detailed loss data for at least two weeks to establish a factual baseline, then prioritize the biggest loss category first. Set incremental targets and track OEE daily with visual management boards.",
      "keywords": ["OEE", "availability", "performance", "quality", "TPM", "SMED", "Pareto analysis", "poka-yoke", "visual management"]
    },
    {
      "question_text": "Workers on the shop floor say that 5S is just housekeeping and does not add value. How would you change their perspective?",
      "question_type": "situational",
      "difficulty": "easy",
      "expected_answer": "Acknowledge that 5S can seem like simple housekeeping on the surface, and that poorly implemented 5S programs that focus only on cleaning without connecting to operational outcomes deserve this criticism. Reframe 5S as a foundational management system that directly impacts their daily work: Sort eliminates time wasted searching for tools and materials, Set in Order creates a workstation layout that reduces motion and fatigue, Shine serves as inspection that catches equipment problems before they cause breakdowns or safety incidents, Standardize ensures that improvements stick and are consistent across shifts, and Sustain builds the discipline needed for all lean improvements. Use concrete examples from their own work area: calculate time spent searching for tools, show how visual organization prevented a mistake, or demonstrate how cleaning revealed an oil leak before equipment failure. Involve workers in designing their own 5S standards rather than imposing top-down requirements. Measure and share the impact, such as reduced changeover time, fewer defects from wrong materials, or improved safety. Make 5S audits collaborative rather than punitive.",
      "keywords": ["5S value", "worker engagement", "reframing", "concrete examples", "measurement", "collaboration", "foundational", "connection to outcomes"]
    },
    {
      "question_text": "You have been asked to reduce the lead time of a product from 15 days to 5 days. How would you approach this?",
      "question_type": "situational",
      "difficulty": "hard",
      "expected_answer": "Begin with a value stream map of the current state to understand where the 15 days are spent. Typically, the vast majority of lead time is waiting time (queue time between operations) rather than actual processing time. Identify the ratio of value-added time to total lead time. Key strategies to reduce lead time include: implementing continuous flow where possible, connecting sequential processes to eliminate queue time; converting batch processing to single-piece flow or small batches; implementing a pull system with kanban to reduce WIP and queue time; applying SMED to reduce changeover times, enabling smaller batches; improving process reliability through TPM to reduce unplanned downtime; redesigning the production layout to reduce transportation time and enable cellular manufacturing; cross-training workers for flexible manning; leveling the production schedule (heijunka) to reduce batching effects; and addressing the longest queues first as they represent the biggest lead time reduction opportunity. Create a future state map showing the target 5-day lead time and develop a prioritized implementation plan. Set intermediate milestones and track lead time reduction weekly.",
      "keywords": ["lead time reduction", "value stream map", "continuous flow", "single-piece flow", "pull system", "SMED", "cellular manufacturing", "heijunka"]
    },
    {
      "question_text": "Two departments are blaming each other for quality defects at their handoff point. How would you use lean tools to resolve this?",
      "question_type": "situational",
      "difficulty": "hard",
      "expected_answer": "This is a classic system problem that lean addresses through process focus rather than departmental blame. Start by mapping the handoff process in detail using a process map or value stream map that spans both departments, making the work visible and objective. Collect data at the handoff point to establish facts: what defects are occurring, their frequency, their root causes, and whether they originate upstream or are caused during the handoff itself. Use a cross-functional team from both departments to conduct root cause analysis together, building shared understanding. Implement countermeasures such as clear quality standards at the handoff with visual acceptance criteria, standard work for the handoff process, poka-yoke devices to prevent defects from passing, immediate feedback loops so upstream operations learn quickly about downstream quality issues (implementing stop-and-fix rather than pass-and-hope), and regular joint quality reviews. The deeper lean principle is to eliminate the handoff altogether if possible by creating continuous flow across the departmental boundary through cellular manufacturing or process redesign. Changing the system so departments have shared accountability for quality outcomes eliminates the incentive to blame.",
      "keywords": ["handoff quality", "cross-functional", "root cause analysis", "visual standards", "feedback loops", "process mapping", "shared accountability", "system thinking"]
    },
    {
      "question_text": "Explain the concept of Standard Work in lean manufacturing and its three key elements.",
      "question_type": "domain_specific",
      "difficulty": "easy",
      "expected_answer": "Standard Work is a detailed, documented description of the currently best-known method for performing a task. It establishes the baseline for consistent, repeatable performance and serves as the foundation for improvement because you cannot improve a process that is not standardized. The three key elements are: 1) Takt time, the rate at which products must be produced to meet customer demand, setting the pace for standard work. 2) Work sequence, the specific order in which an operator performs the tasks within a cycle, designed for efficiency, quality, and safety. 3) Standard work-in-process (SWIP), the minimum amount of inventory needed within the work sequence to maintain smooth, continuous flow. Standard work is documented using three key documents: the standardized work chart (showing the layout, flow, and work sequence), the standardized work combination table (showing the relationship between manual work, machine work, and walking), and the production capacity sheet (showing each process step's capacity). Standard work is not static; it is the current best method that serves as the baseline for further Kaizen improvement.",
      "keywords": ["standard work", "takt time", "work sequence", "standard WIP", "baseline", "documentation", "consistency", "foundation for improvement"]
    },
    {
      "question_text": "What is Hoshin Kanri (Policy Deployment) and how does it align lean improvement efforts with organizational strategy?",
      "question_type": "domain_specific",
      "difficulty": "hard",
      "expected_answer": "Hoshin Kanri is a strategic planning and management methodology that aligns the entire organization's improvement efforts with its most important strategic objectives. The process involves: senior leadership identifying 3-5 breakthrough objectives for the year through analysis of long-term vision, market conditions, and current performance gaps. These high-level objectives are then deployed (cascaded) through the organization using a structured catchball process, where each level translates objectives into specific targets and action plans, negotiating upward and downward to ensure alignment and feasibility. Each level develops specific measurable targets, improvement projects, and resource plans that support the higher-level objectives. Progress is reviewed regularly through structured review meetings at each level, with visual management tools such as bowling charts tracking performance against targets. The X-matrix (Hoshin planning matrix) is a key tool that shows the relationship between long-term objectives, annual objectives, improvement priorities, targets, and responsible owners on a single page. Hoshin Kanri prevents the common problem of lean efforts being scattered across unrelated projects and ensures that Kaizen activities directly contribute to the organization's most important goals.",
      "keywords": ["Hoshin Kanri", "policy deployment", "strategic alignment", "catchball", "X-matrix", "breakthrough objectives", "cascading", "bowling chart"]
    },
    {
      "question_text": "What is Total Productive Maintenance (TPM) and what are its eight pillars?",
      "question_type": "domain_specific",
      "difficulty": "medium",
      "expected_answer": "Total Productive Maintenance is a comprehensive approach to equipment maintenance that aims to achieve perfect production with no breakdowns, no slow running, no defects, and no accidents. The eight pillars of TPM are: 1) Autonomous Maintenance, operators perform basic maintenance tasks (cleaning, lubrication, inspection, tightening) to detect abnormalities early. 2) Planned Maintenance, scheduled preventive and predictive maintenance activities to prevent breakdowns. 3) Quality Maintenance, identifying and eliminating the root causes of quality defects related to equipment conditions. 4) Focused Improvement (Kobetsu Kaizen), cross-functional teams addressing the biggest equipment losses. 5) Early Equipment Management, incorporating maintenance lessons into new equipment design and procurement. 6) Training and Education, developing the skills needed for all pillars. 7) Safety, Health, and Environment, achieving zero accidents. 8) TPM in Administration, applying TPM principles to support functions to reduce administrative waste. The foundation supporting all pillars is 5S. TPM's primary metric is OEE, and it aims to shift the maintenance culture from reactive (fix when broken) to proactive (prevent from breaking).",
      "keywords": ["TPM", "Total Productive Maintenance", "eight pillars", "autonomous maintenance", "planned maintenance", "OEE", "zero breakdowns", "proactive maintenance"]
    },
    {
      "question_text": "Explain the concept of Heijunka (production leveling) and why it is important in lean manufacturing.",
      "question_type": "domain_specific",
      "difficulty": "medium",
      "expected_answer": "Heijunka is the practice of leveling both the volume and mix of production over a given time period to reduce batch sizes and smooth the flow of work through the manufacturing system. Instead of producing large batches of one product followed by large batches of another (which creates uneven demand on upstream processes, equipment, and workers), heijunka distributes production of different products evenly throughout the day or week. For example, rather than producing 500 units of Product A on Monday and 500 units of Product B on Tuesday, heijunka would produce a repeating sequence of A-B-A-B throughout both days. Benefits include reduced finished goods inventory (since each product is made more frequently), smoother demand on upstream processes and suppliers, more predictable workflow and resource utilization, reduced lead time for customers, smaller lot sizes that enable faster detection of quality issues, and reduced overburden (Muri) on people and equipment. Heijunka requires short changeover times (enabled by SMED), reliable processes, and disciplined scheduling. The heijunka box is a visual scheduling tool used to sequence production in level increments matching takt time.",
      "keywords": ["heijunka", "production leveling", "volume leveling", "mix leveling", "batch reduction", "heijunka box", "smooth flow", "Muri"]
    },
    {
      "question_text": "What is Poka-Yoke (mistake-proofing), and what are the different types of poka-yoke devices?",
      "question_type": "domain_specific",
      "difficulty": "easy",
      "expected_answer": "Poka-yoke is a lean technique for preventing human errors from becoming defects. Developed by Shigeo Shingo, the concept designs processes and devices so that mistakes are either impossible to make or are immediately detected before they create defective products. There are two main categories: prevention poka-yoke, which makes the error physically impossible (a USB connector that can only be inserted in the correct orientation, asymmetric bolt patterns that prevent wrong assembly), and detection poka-yoke, which alerts the operator when an error has occurred (a sensor that detects a missing component and stops the machine, a counter that verifies the correct number of parts were installed). Detection methods include contact methods (physical shape, size, or weight verification), fixed-value methods (counting correct quantity of operations or components), and motion-step methods (verifying the correct sequence of operations was followed). Poka-yoke devices should be simple, inexpensive, reliable, and close to where the error occurs. They support the Jidoka principle of building quality into the process and are among the most cost-effective quality improvement tools available.",
      "keywords": ["poka-yoke", "mistake-proofing", "error prevention", "detection", "Shigeo Shingo", "contact method", "fixed-value method", "motion-step method"]
    }
  ]
}