{
  "name": "Inventory Management",
  "slug": "inventory_management",
  "sector": "Logistics",
  "sector_slug": "logistics",
  "description": "Interview questions covering stock control, ABC analysis, EOQ, JIT inventory, cycle counting, warehouse management systems, demand forecasting, safety stock calculation, and inventory optimization for logistics professionals.",
  "questions": [
    {
      "question_text": "What is ABC analysis in inventory management and how is it applied in practice?",
      "question_type": "technical",
      "difficulty": "easy",
      "expected_answer": "ABC analysis is a categorization technique based on the Pareto principle (80/20 rule) that classifies inventory items into three categories by their value and importance. Category A items represent approximately 10-20% of total items but account for 70-80% of total inventory value; these require tight control, frequent review, and accurate forecasting. Category B items are approximately 20-30% of items accounting for 15-20% of value; these need moderate control. Category C items are approximately 50-60% of items but only 5-10% of value; these can be managed with simpler controls and less frequent review. In practice, ABC analysis is used to determine reorder frequencies, set safety stock levels, allocate warehouse space with A items in prime picking locations, determine cycle counting frequencies, and prioritize management attention. Some organizations extend this to ABCD or use multi-criteria analysis combining value, volume, criticality, and lead time.",
      "keywords": ["ABC analysis", "Pareto principle", "inventory classification", "value-based", "control levels", "cycle counting", "safety stock"]
    },
    {
      "question_text": "Explain the Economic Order Quantity (EOQ) model. What are its assumptions and limitations?",
      "question_type": "technical",
      "difficulty": "medium",
      "expected_answer": "The Economic Order Quantity (EOQ) model calculates the optimal order quantity that minimizes total inventory costs, which is the sum of ordering costs and holding costs. The formula is EOQ equals the square root of (2 times annual demand times ordering cost per order divided by annual holding cost per unit). Key assumptions include: demand is constant and known, lead time is constant and known, orders are received instantaneously in complete batches, quantity discounts are not considered, and stockouts are not permitted. Limitations include: demand is rarely constant in practice, the model does not account for bulk discounts, it assumes a single product in isolation, it does not consider capacity constraints, and it can be less relevant for perishable goods. Despite these limitations, EOQ provides a useful baseline and can be modified with extensions such as the EOQ with quantity discounts, the production order quantity model, and the planned shortage model. Many organizations use EOQ as a starting point and adjust based on practical constraints.",
      "keywords": ["EOQ", "ordering cost", "holding cost", "optimal quantity", "assumptions", "demand", "lead time", "total cost minimization"]
    },
    {
      "question_text": "What is Just-In-Time (JIT) inventory management and what are the prerequisites for its successful implementation?",
      "question_type": "technical",
      "difficulty": "medium",
      "expected_answer": "Just-In-Time (JIT) is an inventory strategy where materials arrive precisely when needed in the production process, minimizing inventory holding costs and waste. Pioneered by Toyota, JIT aims for zero inventory buffers. Prerequisites for successful implementation include: highly reliable suppliers who can deliver small quantities frequently and on time, stable and predictable demand patterns, robust quality management since there is no buffer stock to absorb defective items, close proximity or short lead times from suppliers, strong supplier relationships and communication systems, flexible production systems that can handle small batch sizes, trained workforce skilled in multiple tasks, effective production scheduling and sequencing, pull-based production systems often using kanban signals, and organizational commitment to continuous improvement. Risks of JIT include vulnerability to supply chain disruptions, natural disasters, and demand spikes. Many companies now use a hybrid approach combining JIT principles with strategic safety stock for critical items.",
      "keywords": ["Just-In-Time", "JIT", "Toyota", "zero inventory", "kanban", "supplier reliability", "pull system", "continuous improvement", "lean"]
    },
    {
      "question_text": "How do you calculate safety stock and what factors influence the appropriate level?",
      "question_type": "technical",
      "difficulty": "hard",
      "expected_answer": "Safety stock is buffer inventory held to protect against variability in demand and supply lead time. The basic formula is: Safety Stock equals Z-score (service level factor) multiplied by the square root of (lead time multiplied by demand variance plus average demand squared multiplied by lead time variance). Factors influencing safety stock levels include: desired service level, where higher service means more safety stock; demand variability, measured by standard deviation of demand; lead time variability, measured by standard deviation of lead time; average lead time, as longer lead times require more buffer; forecast accuracy, where poor forecasts necessitate higher safety stock; supplier reliability and consistency; product criticality and stockout consequences; holding cost constraints; and product shelf life for perishable items. Advanced approaches include dynamic safety stock that adjusts seasonally, simulation-based methods that model complex demand patterns, and machine learning algorithms that incorporate multiple variables. The key trade-off is between service level and inventory investment, and the optimal level depends on the business context and cost of stockouts versus holding costs.",
      "keywords": ["safety stock", "service level", "Z-score", "demand variability", "lead time variability", "stockout cost", "holding cost", "buffer inventory"]
    },
    {
      "question_text": "Describe the cycle counting process and explain how it differs from a full physical inventory.",
      "question_type": "technical",
      "difficulty": "easy",
      "expected_answer": "Cycle counting is a perpetual inventory auditing method where a subset of inventory items is counted on a rotating schedule throughout the year, rather than counting all items at once. It differs from full physical inventory in several ways: cycle counting is conducted continuously without shutting down operations, while physical inventory typically requires a complete operational shutdown; cycle counting focuses on a small number of items each day or week, while physical inventory counts everything at once; cycle counting allows faster identification and correction of discrepancies; and cycle counting is less disruptive to daily operations. Common cycle counting methods include: ABC-based counting where A items are counted most frequently, such as monthly, B items quarterly, and C items annually; random sample counting where items are selected randomly; location-based counting by warehouse zone or aisle; and opportunity counting triggered by specific events like a zero-balance or negative balance. Key best practices include: investigating and resolving all variances, tracking accuracy metrics, identifying root causes of discrepancies, and using findings to improve processes.",
      "keywords": ["cycle counting", "physical inventory", "perpetual audit", "ABC counting", "inventory accuracy", "variance investigation", "root cause analysis"]
    },
    {
      "question_text": "What is a Warehouse Management System (WMS) and what are its core functions?",
      "question_type": "technical",
      "difficulty": "easy",
      "expected_answer": "A Warehouse Management System (WMS) is software that manages and optimizes warehouse operations from receiving to shipping. Core functions include: receiving and put-away management, directing incoming goods to optimal storage locations; inventory tracking using barcode or RFID scanning for real-time visibility; location management organizing the warehouse into zones, aisles, racks, and bins; order picking optimization using strategies like wave picking, batch picking, zone picking, or pick-and-pass; packing and shipping management including carrier selection and label generation; replenishment management automatically triggering restocking of pick faces; labor management tracking worker productivity and allocating tasks; yard management for inbound and outbound trailer scheduling; returns processing and reverse logistics; reporting and analytics on key performance indicators such as orders per hour, accuracy rates, and space utilization. A WMS integrates with ERP systems, TMS, and e-commerce platforms to ensure end-to-end supply chain visibility. Benefits include improved accuracy typically above 99.5%, reduced labor costs, better space utilization, and faster order fulfillment.",
      "keywords": ["WMS", "warehouse management", "receiving", "put-away", "picking", "barcode", "RFID", "inventory tracking", "labor management"]
    },
    {
      "question_text": "Explain demand forecasting methods used in inventory management. When would you choose quantitative versus qualitative methods?",
      "question_type": "technical",
      "difficulty": "hard",
      "expected_answer": "Demand forecasting methods fall into two categories. Quantitative methods use historical data and include: time series methods such as moving average, exponential smoothing, and ARIMA; causal models such as regression analysis that correlate demand with external factors like economic indicators, weather, or marketing spend; and machine learning methods using algorithms like random forests, neural networks, or gradient boosting that can capture complex nonlinear patterns. Qualitative methods rely on judgment and include: Delphi method gathering expert consensus, market research and surveys, sales force composite aggregating field estimates, and executive opinion. Quantitative methods are chosen when sufficient historical data exists, demand patterns are stable or have identifiable trends and seasonality, and when forecasting existing products. Qualitative methods are preferred for new product launches with no history, when market disruptions invalidate historical patterns, for long-range strategic planning, or when external factors are expected to change significantly. Best practice often combines both approaches, using quantitative models as a baseline adjusted by qualitative judgment. Forecast accuracy should be measured using metrics like MAPE, MAD, or bias.",
      "keywords": ["demand forecasting", "time series", "exponential smoothing", "regression", "Delphi method", "MAPE", "qualitative", "quantitative", "machine learning"]
    },
    {
      "question_text": "What is the bullwhip effect in supply chain management and how does it relate to inventory management?",
      "question_type": "technical",
      "difficulty": "medium",
      "expected_answer": "The bullwhip effect describes the phenomenon where small fluctuations in consumer demand are progressively amplified as orders move upstream through the supply chain, from retailer to wholesaler to manufacturer to raw material supplier. Each level in the chain tends to over-order to buffer against perceived demand changes, creating increasingly exaggerated swings in inventory and ordering patterns. Causes include: demand forecast updating where each level forecasts independently, order batching where companies order in large batches rather than matching actual demand, price fluctuations triggering forward buying during promotions, and rationing and shortage gaming where buyers inflate orders during shortages. Inventory management impacts include excess inventory at some points and stockouts at others, increased holding costs, production inefficiencies, and wasted resources. Mitigation strategies include: sharing point-of-sale data across the supply chain, implementing Vendor Managed Inventory (VMI), using collaborative planning, forecasting, and replenishment (CPFR), reducing lead times, adopting everyday low pricing strategies, and breaking down order batches into smaller, more frequent orders.",
      "keywords": ["bullwhip effect", "demand amplification", "VMI", "CPFR", "information sharing", "order batching", "forward buying", "supply chain visibility"]
    },
    {
      "question_text": "Tell me about a time when you identified and resolved a significant inventory discrepancy. What was your approach?",
      "question_type": "behavioral",
      "difficulty": "medium",
      "expected_answer": "A strong response should describe a specific situation involving a material inventory discrepancy, such as system quantities not matching physical counts. The candidate should explain: how the discrepancy was discovered, whether through cycle counting, order fulfillment issues, or financial reconciliation; the investigation methodology used to identify the root cause, such as reviewing transaction history, checking receiving records, examining picking accuracy, or auditing system entries; the root cause identified, which might include receiving errors, unreported damages, theft, system transaction errors, or unit of measure discrepancies; the immediate corrective action taken to adjust inventory and fulfill any affected orders; and the long-term preventive measures implemented such as process changes, additional controls, staff training, or system enhancements. The candidate should demonstrate analytical thinking, systematic problem-solving, attention to detail, and the ability to implement process improvements to prevent recurrence.",
      "keywords": ["inventory discrepancy", "root cause analysis", "investigation", "corrective action", "preventive measures", "process improvement", "cycle counting"]
    },
    {
      "question_text": "Describe a situation where you had to manage inventory during a period of unexpected demand surge or supply disruption.",
      "question_type": "behavioral",
      "difficulty": "hard",
      "expected_answer": "A strong answer should detail a specific event such as a seasonal spike, viral product demand, supplier failure, natural disaster, or pandemic-related disruption. The candidate should describe: the initial assessment of the situation including impact on inventory levels and customer commitments; immediate actions taken such as implementing allocation rules for limited stock, sourcing from alternative suppliers, expediting shipments, or adjusting safety stock parameters; communication with stakeholders including sales, customers, suppliers, and management; demand management strategies like prioritizing key accounts, implementing order limits, or adjusting pricing; longer-term adjustments to inventory policies, supplier diversification, or forecasting models; and lessons learned that improved future resilience. The response should demonstrate crisis management skills, cross-functional collaboration, data-driven decision making, and the ability to balance competing priorities under pressure.",
      "keywords": ["demand surge", "supply disruption", "allocation", "alternative sourcing", "crisis management", "stakeholder communication", "resilience"]
    },
    {
      "question_text": "Tell me about a time when you implemented a new inventory management system or process. What challenges did you face?",
      "question_type": "behavioral",
      "difficulty": "medium",
      "expected_answer": "The candidate should describe a specific implementation such as a WMS deployment, new counting methodology, inventory optimization software, or process redesign. Key elements of a strong response include: the business case and objectives for the change; the planning process including stakeholder buy-in, resource allocation, and timeline; data migration and system configuration challenges; user training and change management approach; testing and validation procedures; go-live execution and support; unexpected challenges such as data quality issues, user resistance, integration problems, or performance issues and how they were resolved; and measurable results achieved such as improved accuracy, reduced carrying costs, faster fulfillment, or better visibility. The response should demonstrate project management skills, technical understanding, change management capability, and results orientation.",
      "keywords": ["system implementation", "WMS", "change management", "data migration", "user training", "go-live", "measurable results", "project management"]
    },
    {
      "question_text": "How would you handle a situation where your company's inventory carrying costs have increased by 25% year over year?",
      "question_type": "situational",
      "difficulty": "medium",
      "expected_answer": "Addressing a 25% increase in carrying costs requires: first, conducting a detailed analysis to identify the drivers, which could include increased inventory levels, higher warehouse costs, increased obsolescence, rising insurance premiums, or opportunity cost of capital; performing an ABC analysis review to identify slow-moving and obsolete items; reviewing safety stock levels across all SKUs to identify excess buffer; evaluating demand forecasting accuracy and improving models to reduce over-ordering; implementing or tightening min-max inventory parameters; negotiating with suppliers for smaller, more frequent deliveries to reduce average inventory; examining product lifecycle management to identify end-of-life items for markdown or disposal; reviewing warehouse space utilization and exploring more efficient storage solutions; considering consignment inventory arrangements with key suppliers; evaluating just-in-time delivery for high-volume items; and presenting a cost reduction plan to management with specific targets, timelines, and expected savings. The response should be data-driven and balance cost reduction with maintaining service levels.",
      "keywords": ["carrying costs", "slow-moving inventory", "obsolescence", "safety stock optimization", "ABC review", "min-max", "consignment", "cost reduction plan"]
    },
    {
      "question_text": "Your WMS shows 500 units of a critical product, but the picking team reports the location is empty. Walk through your troubleshooting process.",
      "question_type": "situational",
      "difficulty": "easy",
      "expected_answer": "Systematic troubleshooting should include: first, verifying the picker went to the correct location by confirming the bin, aisle, and zone; checking if the product has been relocated or is in a different pick face or overflow location; reviewing recent transaction history in the WMS for the SKU, including receiving, transfers, picks, and adjustments; checking if a recent receiving transaction was confirmed in the system but goods were not physically put away yet; examining whether the product has multiple locations and the system directed to the wrong one; verifying if pending transfers or replenishment tasks exist that might affect the count; checking for recent cycle counts or adjustments that may not have been processed; investigating whether the correct product code was scanned, as similar SKUs can cause confusion; looking at adjacent locations for misplaced inventory; reviewing if the product was picked for another order but not system-confirmed; and escalating to a physical search of the warehouse if the above steps do not resolve the issue. The immediate priority is fulfilling the customer order, potentially from alternate locations, while conducting the investigation.",
      "keywords": ["WMS discrepancy", "troubleshooting", "transaction history", "location verification", "misplaced inventory", "system reconciliation"]
    },
    {
      "question_text": "You have been asked to reduce overall inventory levels by 20% while maintaining a 98% service level. How would you approach this challenge?",
      "question_type": "situational",
      "difficulty": "hard",
      "expected_answer": "Approaching this challenge requires a structured methodology: begin with a comprehensive inventory segmentation using ABC-XYZ analysis, combining value (ABC) with demand variability (XYZ) to create differentiated strategies; for AX items with high value and stable demand, implement tighter replenishment with reduced safety stock; for AZ items with high value and unpredictable demand, focus on improving forecast accuracy or collaborative planning with key customers; aggressively reduce CZ items through liquidation, discontinuation, or consignment arrangements; implement or refine demand planning processes to reduce forecast error, the primary driver of safety stock requirements; negotiate shorter lead times with suppliers, as lead time reduction directly decreases safety stock needs; evaluate supplier-managed inventory or vendor-managed inventory programs; review and optimize reorder points and order quantities using statistical methods rather than rules of thumb; implement postponement strategies where possible, delaying final configuration until demand is confirmed; establish KPI dashboards monitoring inventory turns, days of supply, fill rates, and excess and obsolete levels; and create a phased implementation plan with milestones and accountability, understanding that some quick wins are possible but sustainable reduction requires process and system improvements.",
      "keywords": ["inventory reduction", "ABC-XYZ analysis", "service level", "safety stock optimization", "lead time reduction", "VMI", "postponement", "demand planning"]
    },
    {
      "question_text": "A key supplier informs you that they will be shutting down for 3 weeks for maintenance, doubling their normal lead time. How do you prepare?",
      "question_type": "situational",
      "difficulty": "medium",
      "expected_answer": "Preparation should include: immediately identifying all SKUs sourced from this supplier and their current inventory positions; calculating the additional inventory needed to cover the extended lead time period based on forecasted demand plus safety stock; determining if warehouse capacity exists for the additional stock and arranging overflow storage if needed; placing advance orders to build up buffer stock before the shutdown begins, coordinating delivery schedules to spread the build-up; assessing whether the additional inventory investment is within budget and seeking approval for incremental costs; identifying alternative or backup suppliers who could provide substitute products if needed; communicating with sales and customer service teams about potential risks and any necessary adjustments to customer commitments; reviewing if any planned promotions or demand increases coincide with the shutdown period and adjusting timing if possible; establishing monitoring points and trigger levels for escalation during the shutdown period; and creating a post-shutdown plan to draw down excess inventory systematically and return to normal ordering patterns. Documentation and lessons learned should inform contingency planning for future supplier disruptions.",
      "keywords": ["supplier shutdown", "buffer stock", "lead time increase", "advance ordering", "alternative suppliers", "demand planning", "contingency preparation"]
    },
    {
      "question_text": "What are the key inventory management KPIs and how do you use them to drive performance improvement?",
      "question_type": "domain_specific",
      "difficulty": "easy",
      "expected_answer": "Key inventory management KPIs include: Inventory Turnover Ratio measuring how many times inventory is sold and replaced per year, with higher being better; Days of Supply or Days Inventory Outstanding indicating how many days current inventory will last; Fill Rate or Service Level measuring the percentage of orders fulfilled completely from available stock; Carrying Cost as a Percentage of Inventory Value typically ranging from 15-30% annually; Stockout Rate tracking the frequency and duration of out-of-stock events; Inventory Accuracy measuring the match between system records and physical counts, with best-in-class above 99%; Gross Margin Return on Investment (GMROI) measuring profit generated per dollar invested in inventory; Dead Stock or Obsolete Inventory Percentage tracking unsaleable items; and Order Cycle Time from order placement to delivery. These KPIs are used by setting targets based on industry benchmarks and historical performance, tracking trends over time, conducting root cause analysis on negative variances, linking KPIs to specific operational processes and responsible individuals, and reviewing regularly in operational and management meetings to drive accountability and continuous improvement.",
      "keywords": ["inventory turnover", "days of supply", "fill rate", "carrying cost", "stockout rate", "inventory accuracy", "GMROI", "dead stock", "KPIs"]
    },
    {
      "question_text": "What is the difference between periodic and perpetual inventory systems? What are the advantages of each?",
      "question_type": "domain_specific",
      "difficulty": "easy",
      "expected_answer": "A periodic inventory system updates inventory records at fixed intervals such as weekly, monthly, or quarterly through physical counts. Between counts, the system does not maintain a running balance; cost of goods sold is calculated at the end of the period using the formula: beginning inventory plus purchases minus ending inventory. A perpetual inventory system continuously updates inventory records in real time as transactions occur, including receipts, sales, transfers, and adjustments, typically through barcode or RFID scanning. Advantages of periodic systems include lower implementation cost, simpler to manage for small businesses, and no need for technology infrastructure. Advantages of perpetual systems include real-time inventory visibility, immediate detection of discrepancies, support for automated reordering, better theft and shrinkage detection, more accurate financial reporting, and support for advanced analytics and optimization. Most modern businesses use perpetual systems, especially those with significant inventory investment, high transaction volumes, or multi-location operations. Even with perpetual systems, periodic physical counts or cycle counting remains important for validation.",
      "keywords": ["periodic system", "perpetual system", "real-time tracking", "physical count", "barcode", "RFID", "inventory visibility", "cost of goods sold"]
    },
    {
      "question_text": "Explain the concept of inventory optimization and how it differs from basic inventory management.",
      "question_type": "domain_specific",
      "difficulty": "medium",
      "expected_answer": "Basic inventory management focuses on maintaining stock through reorder points, order quantities, and safety stock using relatively simple rules and parameters. Inventory optimization goes further by using advanced mathematical models and algorithms to simultaneously balance service level targets, inventory investment, and supply chain constraints across the entire product portfolio and network. Key differences include: optimization considers the interdependencies between SKUs, locations, and echelons rather than treating each independently; it uses probabilistic models that account for demand and supply uncertainty distributions rather than simple averages; it incorporates multi-echelon optimization that determines optimal stock positioning across distribution centers and warehouses holistically; it dynamically adjusts parameters based on changing conditions rather than using static settings; and it explicitly models the trade-off between service level and inventory cost, allowing data-driven decisions about where to invest in stock. Optimization tools use techniques such as stochastic modeling, simulation, and machine learning to recommend inventory policies that achieve target service levels with the minimum inventory investment. The result is typically a 10-30% reduction in inventory while maintaining or improving service levels.",
      "keywords": ["inventory optimization", "multi-echelon", "stochastic modeling", "service level trade-off", "demand uncertainty", "probabilistic models", "portfolio optimization"]
    },
    {
      "question_text": "What are the different inventory valuation methods and how do they impact financial reporting?",
      "question_type": "domain_specific",
      "difficulty": "medium",
      "expected_answer": "The primary inventory valuation methods are: FIFO (First-In, First-Out) which assumes the oldest inventory is sold first, resulting in ending inventory valued at the most recent purchase prices; LIFO (Last-In, First-Out) which assumes the newest inventory is sold first, resulting in ending inventory valued at older prices, note that LIFO is not permitted under IFRS; Weighted Average Cost which calculates an average cost per unit by dividing total cost of goods available by total units available; and Specific Identification which tracks the actual cost of each individual item, used for unique or high-value goods. Financial reporting impacts include: during rising prices, FIFO results in higher ending inventory values, lower cost of goods sold, and higher reported profits, while LIFO produces the opposite effect; LIFO provides a tax advantage during inflation by reducing taxable income; weighted average smooths out price fluctuations; the chosen method affects balance sheet inventory values, income statement profitability, and key financial ratios. Consistency in application is required under accounting standards, and changes require disclosure. The method chosen should reflect the actual physical flow of goods where practical.",
      "keywords": ["FIFO", "LIFO", "weighted average", "specific identification", "inventory valuation", "cost of goods sold", "financial reporting", "IFRS"]
    },
    {
      "question_text": "What is vendor-managed inventory (VMI) and what are the benefits and risks for both the buyer and the supplier?",
      "question_type": "domain_specific",
      "difficulty": "hard",
      "expected_answer": "Vendor-Managed Inventory (VMI) is a supply chain arrangement where the supplier takes responsibility for managing and replenishing the buyer's inventory based on agreed-upon service levels and inventory parameters. The supplier monitors the buyer's inventory levels, often through shared data systems, and makes replenishment decisions including timing and quantities. Benefits for the buyer include: reduced inventory management burden, lower stockout risk, reduced safety stock requirements, and freed-up working capital if consignment terms apply. Benefits for the supplier include: better demand visibility, improved production planning, stronger customer relationship, and potential for increased sales. Risks for the buyer include: dependence on supplier performance, potential loss of control over inventory decisions, data sharing concerns, and switching cost if the relationship fails. Risks for the supplier include: increased responsibility and liability, investment in monitoring systems, potential for excess inventory if demand is overestimated, and higher service expectations. Successful VMI requires: clear contractual terms defining responsibilities, shared demand data and forecasts, agreed performance metrics and review processes, and strong IT integration between parties.",
      "keywords": ["vendor-managed inventory", "VMI", "consignment", "demand visibility", "supplier responsibility", "data sharing", "replenishment", "service levels"]
    },
    {
      "question_text": "How do you manage inventory for products with short shelf lives or expiration dates?",
      "question_type": "technical",
      "difficulty": "medium",
      "expected_answer": "Managing perishable or expiring inventory requires specialized approaches: implementing FEFO (First-Expired, First-Out) picking logic in the WMS to ensure items closest to expiration are picked first; establishing minimum remaining shelf life requirements for customer shipments to avoid delivering near-expired goods; setting up automated alerts for items approaching expiration thresholds; configuring the WMS to block picking of expired items; implementing lot tracking and traceability from receiving through shipping; working with demand planning to align order quantities with consumption rates to minimize waste; negotiating shorter, more frequent delivery schedules with suppliers to receive fresher stock; establishing markdown or donation programs for items approaching expiration; monitoring and reporting waste and shrinkage by cause for continuous improvement; setting up separate warehouse zones with appropriate environmental controls for temperature-sensitive items; and conducting regular reviews of slow-moving items to adjust stocking decisions before expiration becomes a recurring problem.",
      "keywords": ["FEFO", "shelf life", "expiration management", "lot tracking", "perishable inventory", "waste reduction", "markdown", "traceability"]
    },
    {
      "question_text": "Describe your approach to handling slow-moving and obsolete inventory. How do you prevent it from accumulating?",
      "question_type": "behavioral",
      "difficulty": "easy",
      "expected_answer": "A good answer should cover both reactive and proactive strategies. Reactive measures for existing slow-moving and obsolete stock include: conducting regular aging analysis to identify items exceeding defined thresholds such as no movement for 90, 180, or 365 days; implementing tiered disposition strategies such as discounted sales, bundling with popular items, selling through alternate channels, donating for tax benefit, or scrapping as a last resort; and writing down or writing off obsolete inventory per accounting policies. Proactive prevention strategies include: implementing new product introduction and phase-out processes that manage transitions; requiring demand validation before stocking new items; setting up automatic alerts when items first become slow-moving for early intervention; reviewing minimum order quantities with suppliers to avoid over-buying; conducting regular portfolio reviews to rationalize the SKU base; using product lifecycle management to anticipate obsolescence; and establishing cross-functional review teams including purchasing, sales, and operations to make disposition decisions. The candidate should demonstrate a systematic, data-driven approach with clear metrics and governance.",
      "keywords": ["slow-moving inventory", "obsolete inventory", "aging analysis", "disposition", "SKU rationalization", "product lifecycle", "prevention", "write-off"]
    },
    {
      "question_text": "Your demand forecast was significantly off for the past quarter, resulting in both stockouts for some products and excess inventory for others. How would you address this?",
      "question_type": "situational",
      "difficulty": "hard",
      "expected_answer": "Addressing significant forecast inaccuracy requires a comprehensive review: first, quantify the impact by measuring forecast error metrics such as MAPE, bias, and weighted MAPE by product category and customer segment; analyze the root causes by examining whether the errors were due to model inadequacy, data quality issues, external events not captured in the model, promotional impacts, or customer behavior changes; review the forecasting methodology to determine if the current approach is appropriate for the demand patterns observed; assess whether the right data inputs are being used and if new data sources could improve accuracy; evaluate the forecast review and adjustment process to determine if human overrides improved or degraded accuracy; implement short-term corrective actions such as expediting for stockout items and markdown strategies for excess; develop an improvement plan that might include adopting more sophisticated models, implementing forecast segmentation by demand pattern, improving collaboration with sales and marketing for demand intelligence, shortening the forecast review cycle, and adding exception-based management to focus attention on the highest-impact items. Set improvement targets and track progress monthly.",
      "keywords": ["forecast accuracy", "MAPE", "root cause analysis", "model improvement", "demand segmentation", "bias", "collaborative forecasting", "corrective action"]
    },
    {
      "question_text": "How do you approach inventory management in a multi-location or multi-warehouse environment?",
      "question_type": "technical",
      "difficulty": "hard",
      "expected_answer": "Multi-location inventory management adds complexity requiring: network-level inventory visibility across all locations through an integrated WMS or ERP system; demand allocation modeling to determine which warehouse should fulfill which customer orders based on proximity, inventory availability, and shipping costs; differentiated stocking strategies by location based on local demand patterns rather than applying uniform policies; inter-warehouse transfer logic to balance inventory across the network and prevent stockouts at one location while another has excess; centralized versus decentralized inventory decisions, determining which items to hold at all locations versus keeping at a central hub for redistribution; network safety stock optimization that considers total network inventory rather than optimizing each location independently, which typically results in lower total inventory; transportation cost trade-offs between holding more distributed inventory closer to customers versus centralizing and paying higher shipping costs; master data governance ensuring consistent product information across all locations; and unified reporting and KPIs that provide both location-level and network-level performance views. Multi-echelon inventory optimization tools can model the entire network to recommend optimal stock positioning.",
      "keywords": ["multi-location", "network inventory", "demand allocation", "inter-warehouse transfer", "centralized planning", "multi-echelon", "stock positioning", "distributed inventory"]
    },
    {
      "question_text": "Tell me about a time when you had to work with other departments, such as sales or procurement, to resolve an inventory-related issue. How did you collaborate effectively?",
      "question_type": "behavioral",
      "difficulty": "easy",
      "expected_answer": "A good response should describe a specific cross-functional situation such as sales running an unapproved promotion that depleted stock, procurement ordering incorrect quantities due to miscommunication, or a product launch requiring coordinated inventory buildup. The candidate should explain: the nature of the inventory issue and which departments were involved; how they initiated communication and brought the right stakeholders together; the data and analysis they shared to frame the problem objectively; the collaborative solution developed, such as establishing regular demand review meetings, creating shared visibility dashboards, implementing approval workflows for promotions, or developing joint forecasting processes; any compromises or trade-offs negotiated between competing priorities; and the outcome in terms of resolved issue and improved ongoing collaboration. The response should demonstrate communication skills, relationship building, a data-driven approach to cross-functional discussions, and the ability to see beyond one's own functional silo.",
      "keywords": ["cross-functional collaboration", "sales alignment", "procurement coordination", "communication", "shared visibility", "demand review", "stakeholder management"]
    }
  ]
}